tap "homebrew/bundle"
tap "homebrew/services"

tap "artginzburg/tap"
brew "artginzburg/tap/sudo-touchid"

brew "rom-tools"

cask "aegisub"
cask "audacity"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "handbrake"
cask "iina"
cask "istat-menus"
cask "iterm2"
cask "jdownloader"
cask "krita"
cask "makemkv"
cask "microsoft-remote-desktop"
cask "mkvtoolnix"
cask "musicbrainz-picard"
cask "the-unarchiver"

mas "Bitwarden", id: 1352778147
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
